{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Introduction to Neo4j and Cypher\n",
    "\n",
    "Cypher, originally created for Neo4j, is a query language supported by many graph databases. \n",
    "This lab will walk you through the very basics: setting up a connection, querying nodes, and identifying edges."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Topics covered\n",
    " 1. Graph Data Structure Concepts\n",
    " 1. Graph Database (Neo4j)   "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Node Assignments \n",
    "\n",
    "* Server `neo4j-1.dsa.lan`: Last name A - G \n",
    "* Server `neo4j-2.dsa.lan`: Last name H - M\n",
    "* Server `neo4j-3.dsa.lan`: Last name N - S\n",
    "* Server `neo4j-4.dsa.lan`: Last name T - Y"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Readings\n",
    "  * [What is a Graph Database](https://neo4j.com/developer/graph-database/)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Basic Cypher Query Language\n",
    "In the examples below, you are seeing basic cypher language queries. \n",
    "\n",
    "[You can read a complete over view of the Cypher language here](https://neo4j.com/developer/cypher-query-language/)\n",
    "\n",
    "**A few of its highlights are pasted below:**\n",
    "\n",
    "__About Cypher__\n",
    "\n",
    "Cypher is a declarative, SQL-inspired language for describing patterns in graphs visually using an ascii-art syntax.\n",
    "\n",
    "It allows us to state what we want to select, insert, update or delete from our graph data without requiring us to describe exactly how to do it.\n",
    "\n",
    "__Nodes__\n",
    "\n",
    "Cypher uses ASCII-Art to represent patterns. We surround nodes with parentheses which look like circles, e.g. (node). If we later want to refer to the node, we’ll give it an variable like (p) for person or (t) for thing. In real-world queries, we’ll probably use longer, more expressive variable names like (person) or (thing). If the node is not relevant to your question, you can also use empty parentheses ().\n",
    "\n",
    "Usually, the relevant labels of the node are provided to distinguish between entities and optimize execution, like (p:Person).\n",
    "\n",
    "We might use a pattern like (person:Person)-->(thing:Thing) so we can refer to them later, for example, to access properties like person.name and thing.quality.\n",
    "\n",
    "__The more general structure is:__\n",
    "\n",
    "MATCH (node:Label) RETURN node.property\n",
    "\n",
    "MATCH (node1:Label1)-->(node2:Label2) WHERE node1.propertyA = {value} RETURN node2.propertyA, node2.propertyB\n",
    "\n",
    "Please note that node-labels, relationship-types and property-names are case-sensitive in Cypher. All the other clauses, keywords and functions are not, but should be cased consistently according to the style used here.\n",
    "\n",
    "__Relationships__\n",
    "\n",
    "To fully utilize the power of our graph database we want to express more complex patterns between our nodes. Relationships are basically an arrow --> between two nodes. Additional information can be placed in square brackets inside of the arrow.\n",
    "\n",
    "__This can be__\n",
    "\n",
    "relationship-types like -[:KNOWS|:LIKE]->\n",
    "\n",
    "a variable name -[rel:KNOWS]-> before the colon\n",
    "additional properties -[{since:2010}]->\n",
    "structural information for paths of variable length -[:KNOWS*..4]->\n",
    "To access information about a relationship, we can assign it a variable, for later reference. It is placed in front of the colon -[rel:KNOWS]-> or stands alone -[rel]->."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connecting\n",
    "Connecting to a Neo4j database is slightly easier than a standard database, as each database contains only one graph. No schemas or databases to pick from, just a username, a password, and a port. Bolt is a binary protocol for database connections designed by the Neo4j team, much like ones used by other database applications. This avoids the overhead of text-based connections like HTTP."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "#################################################\n",
    "# Update UPDATE-ME in the connection code with \n",
    "# The server you were assigned (see the schedule \n",
    "# notebook) to connect to using the \n",
    "# Links below.\n",
    "#################################################\n",
    "# Server 1 - neo4j-1.dsa.lan\n",
    "# Server 2 - neo4j-2.dsa.lan\n",
    "# Server 3 - neo4j-3.dsa.lan\n",
    "# Server 4 - neo4j-4.dsa.lan\n",
    "#################################################\n",
    "\n",
    "graph = Graph(\"bolt://wikiread:wikireader@neo4j-1.dsa.lan:9000\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Identifying a Node\n",
    "\n",
    "As you may have guessed from the connection information, we're using some simple Wikipedia data. Each node represents a single Wikipedia article, and each edge is a link from one article to another.\n",
    "\n",
    "Let's lookup a single Wikipedia page in the graph. There's only one type of node in this graph, a Page. Each node has an id number, and each Page contains a title. With this, let's lookup a page using a MATCH statement.\n",
    "\n",
    "In Cypher, a node is identified by a set of parentheses, and its parameters with braces. Here we ask the server to lookup p, a node with the Page label, which has the title Neo4j and return it to us."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " p                                \r\n",
      "----------------------------------\r\n",
      " (_6745383:Page {title: 'Neo4j'}) \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (p:Page {title: 'Neo4j'}) RETURN p\")\n",
    "\n",
    "print(data.to_table())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "In the returned data, we see the node's ID (prefixed with an underscore), its label, and its properties. But this didn't tell us much that we didn't already know.\n",
    "\n",
    "Note above that we ran the query with a filter specifying we only wanted to look for Page nodes even know we know the database only contains Page nodes. \n",
    "It's a good idea to specify types, even if there's only one. Just like any other query language, it's important to know both what to ask and how. \n",
    "\n",
    " * Label Filter for `Page` nodes\n",
    "```\n",
    ":Page\n",
    "```\n",
    "\n",
    "Try running that query without the label filter, it's much slower."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "With type specifier: 0.0100 (s)\n",
      "Without type specifier: 8.2775 (s)\n"
     ]
    }
   ],
   "source": [
    "from timeit import default_timer as timer\n",
    "\n",
    "begin = timer()\n",
    "graph.run(\"MATCH (p:Page {title: 'Neo4j'}) RETURN p\")\n",
    "end = timer()\n",
    "print(\"With type specifier: {0:0.4f} (s)\".format(end-begin))\n",
    "\n",
    "begin = timer()\n",
    "graph.run(\"MATCH (p {title: 'Neo4j'}) RETURN p\")\n",
    "end = timer()\n",
    "print(\"Without type specifier: {0:0.4f} (s)\".format(end-begin))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Finding Edges\n",
    "\n",
    "Looking at a single page doesn't tell you much. Let's see what kind of links are going on.\n",
    "\n",
    "In Cypher, edges (links) are indicated by lines or arrows between nodes. \n",
    "Instead of parentheses, edges are identified using square braces. \n",
    "Links can be filtered by type and properties as well. \n",
    "The direction of the arrow indicates the direction of the edge. \n",
    "Having neither (or both) arrowheads searches both incoming and outgoing edges.\n",
    "\n",
    "Here, we're asking for our Neo4j page, `p`, and any outgoing links, `l`, to other pages."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " p                                | l                                  \r\n",
      "----------------------------------|------------------------------------\r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_9539638)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_7546967)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_1496086)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_881262)   \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_8648946)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_12188)    \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_13622)    \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_1917072)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_6911747)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_8241569)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_1970728)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_10053)    \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_11657601) \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_5292782)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_10420416) \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_40550)    \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_6919349)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_5656)     \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_6596737)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_2438694)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_5211633)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_3876236)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_198304)   \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_2611238)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_7021627)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_2056612)  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_13555986) \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (p:Page {title: 'Neo4j'})-[l:Link]->(:Page) RETURN p,l\")\n",
    "\n",
    "print(data.to_table())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We got some data back, sure, but it's not actually very useful. In the database, edges are just connections between node id numbers. While edges may have useful properties just like nodes, our links do not.\n",
    "\n",
    "----\n",
    "\n",
    "Previously, we asked for every outgoing link, `l`, from our page, `p`, to any arbitrary page. \n",
    "Given what you've seen so far, how do you think we could change the following query to get us our page `p` and all pages it connects to?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " p                                | l                                  | q                                                         \r\n",
      "----------------------------------|------------------------------------|-----------------------------------------------------------\r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_9539638)  | (_9539638:Page {title: 'Apache Giraph'})                  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_7546967)  | (_7546967:Page {title: 'Nikolaj Nyholm'})                 \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_1496086)  | (_1496086:Page {title: 'United States'})                  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_881262)   | (_881262:Page {title: 'Remote backup service'})           \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_8648946)  | (_8648946:Page {title: 'Gremlin (programming language)'}) \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_12188)    | (_12188:Page {title: 'Malm\\u00f6'})                       \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_13622)    | (_13622:Page {title: 'North America'})                    \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_1917072)  | (_1917072:Page {title: 'GPLv3'})                          \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_6911747)  | (_6911747:Page {title: 'Neo Technology'})                 \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_8241569)  | (_8241569:Page {title: 'OrientDB'})                       \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_1970728)  | (_1970728:Page {title: 'Sweden'})                         \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_10053)    | (_10053:Page {title: 'Java (programming language)'})      \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_11657601) | (_11657601:Page {title: 'ArangoDB'})                      \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_5292782)  | (_5292782:Page {title: 'San Francisco Bay Area'})         \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_10420416) | (_10420416:Page {title: 'Cypher Query Language'})         \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_40550)    | (_40550:Page {title: 'ACID'})                             \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_6919349)  | (_6919349:Page {title: 'AGPLv3'})                         \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_5656)     | (_5656:Page {title: 'Europe'})                            \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_6596737)  | (_6596737:Page {title: 'Graph database'})                 \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_2438694)  | (_2438694:Page {title: 'Affero General Public License'})  \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_5211633)  | (_5211633:Page {title: 'GNU General Public License'})     \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_3876236)  | (_3876236:Page {title: 'Intentional Software'})           \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_198304)   | (_198304:Page {title: 'CODASYL'})                         \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_2611238)  | (_2611238:Page {title: 'Freemium'})                       \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_7021627)  | (_7021627:Page {title: 'AllegroGraph'})                   \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_2056612)  | (_2056612:Page {title: 'Spring Framework'})               \r\n",
      " (_6745383:Page {title: 'Neo4j'}) | (_6745383)-[:Link {}]->(_13555986) | (_13555986:Page {title: 'DB-Engines ranking'})            \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# This is the code we ran above. Notice how it has been edited to give the pages that connect via the links\n",
    "# -----------------------------------------\n",
    "# data = graph.run(\"MATCH (p:Page {title: 'Neo4j'})-[l:Link]->(:Page) RETURN p,l\")\n",
    "    \n",
    "    # Carefully review the difference between the two lines\n",
    "    \n",
    "data = graph.run(\"MATCH (p:Page {title: 'Neo4j'})-[l:Link]->(q:Page) RETURN p,l,q\")\n",
    "\n",
    "print(data.to_table())\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now that we're capturing the page being linked to we can actually see the relationships between articles. \n",
    "The results are still a little cluttered though. \n",
    "\n",
    "\n",
    "\n",
    "# Language Exploration\n",
    "You can return a property from an object using a dot notation (ex: `a.x`)\n",
    "\n",
    "Tweak your query from above to return only the titles of the pages."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " p.title | q.title                        \r\n",
      "---------|--------------------------------\r\n",
      " Neo4j   | Apache Giraph                  \r\n",
      " Neo4j   | Nikolaj Nyholm                 \r\n",
      " Neo4j   | United States                  \r\n",
      " Neo4j   | Remote backup service          \r\n",
      " Neo4j   | Gremlin (programming language) \r\n",
      " Neo4j   | Malmö                          \r\n",
      " Neo4j   | North America                  \r\n",
      " Neo4j   | GPLv3                          \r\n",
      " Neo4j   | Neo Technology                 \r\n",
      " Neo4j   | OrientDB                       \r\n",
      " Neo4j   | Sweden                         \r\n",
      " Neo4j   | Java (programming language)    \r\n",
      " Neo4j   | ArangoDB                       \r\n",
      " Neo4j   | San Francisco Bay Area         \r\n",
      " Neo4j   | Cypher Query Language          \r\n",
      " Neo4j   | ACID                           \r\n",
      " Neo4j   | AGPLv3                         \r\n",
      " Neo4j   | Europe                         \r\n",
      " Neo4j   | Graph database                 \r\n",
      " Neo4j   | Affero General Public License  \r\n",
      " Neo4j   | GNU General Public License     \r\n",
      " Neo4j   | Intentional Software           \r\n",
      " Neo4j   | CODASYL                        \r\n",
      " Neo4j   | Freemium                       \r\n",
      " Neo4j   | AllegroGraph                   \r\n",
      " Neo4j   | Spring Framework               \r\n",
      " Neo4j   | DB-Engines ranking             \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# This is the code we ran above. Notice how it has been edited to give only the titles of the pages.\n",
    "\n",
    "# ------------------\n",
    "# data = graph.run(\"MATCH (p:Page {title: 'Neo4j'})-[l:Link]->(q:Page) RETURN p,l,q\")\n",
    "    # Carefully review the difference between the two lines\n",
    "    \n",
    "data = graph.run(\"MATCH (p:Page {title: 'Neo4j'})-[l:Link]->(q:Page) RETURN p.title,q.title\")\n",
    "\n",
    "\n",
    "print(data.to_table())\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "That should look much better.\n",
    "\n",
    "Right now, we're looking up outgoing edges, let's change that to incoming edges."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " p.title | q.title                                           \r\n",
      "---------|---------------------------------------------------\r\n",
      " Neo4j   | Paradise Papers                                   \r\n",
      " Neo4j   | Linkurious                                        \r\n",
      " Neo4j   | List of TCP and UDP port numbers                  \r\n",
      " Neo4j   | Query language                                    \r\n",
      " Neo4j   | Connection pool                                   \r\n",
      " Neo4j   | Spatial database                                  \r\n",
      " Neo4j   | Paxos (computer science)                          \r\n",
      " Neo4j   | Well-known text                                   \r\n",
      " Neo4j   | List of JVM languages                             \r\n",
      " Neo4j   | List of software under the GNU AGPL               \r\n",
      " Neo4j   | DataNucleus                                       \r\n",
      " Neo4j   | NoSQL                                             \r\n",
      " Neo4j   | Graph database                                    \r\n",
      " Neo4j   | Comparison of structured storage software         \r\n",
      " Neo4j   | Neo Technology                                    \r\n",
      " Neo4j   | Neo4J                                             \r\n",
      " Neo4j   | FlockDB                                           \r\n",
      " Neo4j   | OrientDB                                          \r\n",
      " Neo4j   | GameDuell                                         \r\n",
      " Neo4j   | Gremlin (programming language)                    \r\n",
      " Neo4j   | Rod Johnson (programmer)                          \r\n",
      " Neo4j   | Jelastic                                          \r\n",
      " Neo4j   | Cypher Query Language                             \r\n",
      " Neo4j   | Hybrid transactional/analytical processing (HTAP) \r\n",
      " Neo4j   | Bolt (network protocol)                           \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# This is the code we ran above. Notice how it has been edited to give the pages that connect via the links\n",
    "\n",
    "# ------------------\n",
    "# data = graph.run(\"MATCH (p:Page {title: 'Neo4j'})-[l:Link]->(q:Page) RETURN p.title,q.title\")\n",
    "    # Carefully review the difference between the two lines \n",
    "    \n",
    "data = graph.run(\"MATCH (p:Page {title: 'Neo4j'})<-[l:Link]-(q:Page) RETURN p.title,q.title\")\n",
    "\n",
    "\n",
    "\n",
    "print(data.to_table())\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "\n",
    "---\n",
    "\n",
    "\n",
    "\n",
    "As mentioned before, we can ask for edges of either direction as well with either `--` or `<-->`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " a.title | b.title                                           \r\n",
      "---------|---------------------------------------------------\r\n",
      " Neo4j   | Apache Giraph                                     \r\n",
      " Neo4j   | Nikolaj Nyholm                                    \r\n",
      " Neo4j   | United States                                     \r\n",
      " Neo4j   | Remote backup service                             \r\n",
      " Neo4j   | Gremlin (programming language)                    \r\n",
      " Neo4j   | Malmö                                             \r\n",
      " Neo4j   | North America                                     \r\n",
      " Neo4j   | GPLv3                                             \r\n",
      " Neo4j   | Neo Technology                                    \r\n",
      " Neo4j   | OrientDB                                          \r\n",
      " Neo4j   | Sweden                                            \r\n",
      " Neo4j   | Java (programming language)                       \r\n",
      " Neo4j   | ArangoDB                                          \r\n",
      " Neo4j   | San Francisco Bay Area                            \r\n",
      " Neo4j   | Cypher Query Language                             \r\n",
      " Neo4j   | ACID                                              \r\n",
      " Neo4j   | AGPLv3                                            \r\n",
      " Neo4j   | Europe                                            \r\n",
      " Neo4j   | Graph database                                    \r\n",
      " Neo4j   | Affero General Public License                     \r\n",
      " Neo4j   | GNU General Public License                        \r\n",
      " Neo4j   | Intentional Software                              \r\n",
      " Neo4j   | CODASYL                                           \r\n",
      " Neo4j   | Freemium                                          \r\n",
      " Neo4j   | AllegroGraph                                      \r\n",
      " Neo4j   | Spring Framework                                  \r\n",
      " Neo4j   | DB-Engines ranking                                \r\n",
      " Neo4j   | Paradise Papers                                   \r\n",
      " Neo4j   | Linkurious                                        \r\n",
      " Neo4j   | List of TCP and UDP port numbers                  \r\n",
      " Neo4j   | Query language                                    \r\n",
      " Neo4j   | Connection pool                                   \r\n",
      " Neo4j   | Spatial database                                  \r\n",
      " Neo4j   | Paxos (computer science)                          \r\n",
      " Neo4j   | Well-known text                                   \r\n",
      " Neo4j   | List of JVM languages                             \r\n",
      " Neo4j   | List of software under the GNU AGPL               \r\n",
      " Neo4j   | DataNucleus                                       \r\n",
      " Neo4j   | NoSQL                                             \r\n",
      " Neo4j   | Graph database                                    \r\n",
      " Neo4j   | Comparison of structured storage software         \r\n",
      " Neo4j   | Neo Technology                                    \r\n",
      " Neo4j   | Neo4J                                             \r\n",
      " Neo4j   | FlockDB                                           \r\n",
      " Neo4j   | OrientDB                                          \r\n",
      " Neo4j   | GameDuell                                         \r\n",
      " Neo4j   | Gremlin (programming language)                    \r\n",
      " Neo4j   | Rod Johnson (programmer)                          \r\n",
      " Neo4j   | Jelastic                                          \r\n",
      " Neo4j   | Cypher Query Language                             \r\n",
      " Neo4j   | Hybrid transactional/analytical processing (HTAP) \r\n",
      " Neo4j   | Bolt (network protocol)                           \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (a:Page {title: 'Neo4j'})<-[:Link]->(b:Page) RETURN a.title,b.title\")\n",
    "\n",
    "print(data.to_table())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "But, since we removed the link information, we can't tell which way the edge goes. Even with it, we'd have to compare id numbers either visually or write some code to process the results.\n",
    "\n",
    "While you can't ask which direction an edge is going (at least at the time of writing), you can ask which node the edge starts with, which can let us hack together a direction indicator and get a taste of what can be done with more complex queries. We'll also be experimenting with graph visualization in later notebooks."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " a.title | direction | b.title                                           \r\n",
      "---------|-----------|---------------------------------------------------\r\n",
      " Neo4j   | --------> | Apache Giraph                                     \r\n",
      " Neo4j   | --------> | Nikolaj Nyholm                                    \r\n",
      " Neo4j   | --------> | United States                                     \r\n",
      " Neo4j   | --------> | Remote backup service                             \r\n",
      " Neo4j   | --------> | Gremlin (programming language)                    \r\n",
      " Neo4j   | --------> | Malmö                                             \r\n",
      " Neo4j   | --------> | North America                                     \r\n",
      " Neo4j   | --------> | GPLv3                                             \r\n",
      " Neo4j   | --------> | Neo Technology                                    \r\n",
      " Neo4j   | --------> | OrientDB                                          \r\n",
      " Neo4j   | --------> | Sweden                                            \r\n",
      " Neo4j   | --------> | Java (programming language)                       \r\n",
      " Neo4j   | --------> | ArangoDB                                          \r\n",
      " Neo4j   | --------> | San Francisco Bay Area                            \r\n",
      " Neo4j   | --------> | Cypher Query Language                             \r\n",
      " Neo4j   | --------> | ACID                                              \r\n",
      " Neo4j   | --------> | AGPLv3                                            \r\n",
      " Neo4j   | --------> | Europe                                            \r\n",
      " Neo4j   | --------> | Graph database                                    \r\n",
      " Neo4j   | --------> | Affero General Public License                     \r\n",
      " Neo4j   | --------> | GNU General Public License                        \r\n",
      " Neo4j   | --------> | Intentional Software                              \r\n",
      " Neo4j   | --------> | CODASYL                                           \r\n",
      " Neo4j   | --------> | Freemium                                          \r\n",
      " Neo4j   | --------> | AllegroGraph                                      \r\n",
      " Neo4j   | --------> | Spring Framework                                  \r\n",
      " Neo4j   | --------> | DB-Engines ranking                                \r\n",
      " Neo4j   | <-------- | Paradise Papers                                   \r\n",
      " Neo4j   | <-------- | Linkurious                                        \r\n",
      " Neo4j   | <-------- | List of TCP and UDP port numbers                  \r\n",
      " Neo4j   | <-------- | Query language                                    \r\n",
      " Neo4j   | <-------- | Connection pool                                   \r\n",
      " Neo4j   | <-------- | Spatial database                                  \r\n",
      " Neo4j   | <-------- | Paxos (computer science)                          \r\n",
      " Neo4j   | <-------- | Well-known text                                   \r\n",
      " Neo4j   | <-------- | List of JVM languages                             \r\n",
      " Neo4j   | <-------- | List of software under the GNU AGPL               \r\n",
      " Neo4j   | <-------- | DataNucleus                                       \r\n",
      " Neo4j   | <-------- | NoSQL                                             \r\n",
      " Neo4j   | <-------- | Graph database                                    \r\n",
      " Neo4j   | <-------- | Comparison of structured storage software         \r\n",
      " Neo4j   | <-------- | Neo Technology                                    \r\n",
      " Neo4j   | <-------- | Neo4J                                             \r\n",
      " Neo4j   | <-------- | FlockDB                                           \r\n",
      " Neo4j   | <-------- | OrientDB                                          \r\n",
      " Neo4j   | <-------- | GameDuell                                         \r\n",
      " Neo4j   | <-------- | Gremlin (programming language)                    \r\n",
      " Neo4j   | <-------- | Rod Johnson (programmer)                          \r\n",
      " Neo4j   | <-------- | Jelastic                                          \r\n",
      " Neo4j   | <-------- | Cypher Query Language                             \r\n",
      " Neo4j   | <-------- | Hybrid transactional/analytical processing (HTAP) \r\n",
      " Neo4j   | <-------- | Bolt (network protocol)                           \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "data = graph.run(\"\"\"\n",
    "MATCH (a:Page {title: 'Neo4j'})<-[l:Link]->(b:Page)\n",
    "\n",
    "RETURN a.title,\n",
    " CASE WHEN STARTNODE(l) = a THEN '-------->' ELSE '<--------' END AS direction,\n",
    " b.title\"\"\")\n",
    "\n",
    "print(data.to_table())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**That's it for this brief introduction to using Cypher and Neo4j.** \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Save your Notebook, then `File > Close and Halt`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
